---
kind: type
id: T:Autodesk.Revit.DB.Rectangle
source: html/c49d8b69-5d11-9f69-5f75-c36ad45ff77b.htm
---
# Autodesk.Revit.DB.Rectangle

Stores a set of four integers that represent the left, top, right and bottom of a rectangle.

## Syntax (C#)
```csharp
public class Rectangle : IDisposable
```

## Remarks
It usually represents a rectangle on the screen. Left must be less than right and top must be less than bottom.